app/controllers/users_controller.rb

    def index
        respond_with @users = User.all
---
SELECT "users".* FROM "users"

    def show
        respond_with @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

    def edit
        respond_with @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]

    def create
        @user = User.new(params[:user])
        set_falsh_message 'User was successfully created.', 'notice' if @user.save
---
INSERT INTO "users" ("age", "created_at", "name", "status", "updated_at") VALUES (?, ?, ?, ?, ?)  [["age", 75], ["created_at", Wed, 20 Mar 2013 16:33:25 UTC +00:00], ["name", "clint"], ["status", true], ["updated_at", Wed, 20 Mar 2013 16:33:25 UTC +00:00]]

    def update
        @user = User.find(params[:id])
        set_falsh_message 'User was successfully updated.', 'notice' if @user.update_attributes params[:user]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "name" = 'lee van cleef', "age" = 90, "updated_at" = '2013-03-21 01:14:42.566036' WHERE "users"."id" = 2

    def destroy
        @user = User.find(params[:id])
        set_falsh_message 'User was successfully destroyed.', 'notice' if @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]